{
  "Swift.vim": { "branch": "master" },
  "a.vim": { "branch": "master" },
  "ack.vim": { "branch": "master" },
  "base16-vim": { "branch": "master" },
  "coc.nvim": { "branch": "release" },
  "fzf": { "branch": "master" },
  "fzf.vim": { "branch": "master" },
  "kotlin-vim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "neoformat": { "branch": "master" },
  "nerdcommenter": { "branch": "master" },
  "nerdtree": { "branch": "master" },
  "nginx.vim": { "branch": "master" },
  "textile.vim": { "branch": "master" },
  "twig.vim": { "branch": "master" },
  "vim-airline": { "branch": "master" },
  "vim-dispatch": { "branch": "master" },
  "vim-endwise": { "branch": "master" },
  "vim-fold-rspec": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-hashicorp-tools": { "branch": "master" },
  "vim-jinja": { "branch": "master" },
  "vim-projectionist": { "branch": "master" },
  "vim-rails": { "branch": "master" },
  "vim-rake": { "branch": "master" },
  "vim-rhubarb": { "branch": "master" },
  "vim-searchlight": { "branch": "master" },
  "vim-sleuth": { "branch": "master" },
  "vim-surround": { "branch": "master" },
  "vim-test": { "branch": "master" },
  "vim-toml": { "branch": "main" },
  "yats.vim": { "branch": "master" }
}
